tap "homebrew/bundle"
tap "ngrok/ngrok"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU grep, egrep and fgrep
brew "grep"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Move, copy, append, and link multiple files
brew "mmv"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# App for note taking, organising, task lists, and archiving
cask "evernote"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# CSV editor
cask "modern-csv"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Home media player
cask "plex"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Team communication and collaboration software
cask "slack"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "aaron-bond.better-comments"
vscode "adamcaviness.theme-monokai-dark-soda"
vscode "akamud.vscode-theme-onedark"
vscode "andys8.jest-snippets"
vscode "angular.ng-template"
vscode "bcanzanella.openmatchingfiles"
vscode "bradlc.vscode-tailwindcss"
vscode "brittanychiang.halcyon-vscode"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "circleci.circleci"
vscode "csstools.postcss"
vscode "dahong.theme-bear"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "geriyoco.vscode-image-gallery"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gregorbiswanger.json2ts"
vscode "hallerpatrick.solarized-autumn"
vscode "hangxingliu.vscode-systemd-support"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-power-mode"
vscode "irongeek.vscode-env"
vscode "iulian-radu-at.find-unused-exports"
vscode "jayfong.generate-index"
vscode "kakumei.ts-debug"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kuscamara.electron"
vscode "loiane.ts-extension-pack"
vscode "loilo.snazzy-light"
vscode "luqimin.tiny-light"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "raeesa.monokai-light"
vscode "redhat.vscode-xml"
vscode "repeale.material-monokai"
vscode "ritwickdey.liveserver"
vscode "sburg.vscode-javascript-booster"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tomwhite007.rename-angular-component"
vscode "tootone.org-mode"
vscode "tyriar.luna-paint"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
