tap "homebrew/bundle"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU grep, egrep and fgrep
brew "grep"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Move, copy, append, and link multiple files
brew "mmv"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Terraform version manager inspired by rbenv
brew "tfenv"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# CSV editor
cask "modern-csv"
# Home media player
cask "plex"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Team communication and collaboration software
cask "slack"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "Amphetamine", id: 937984704
mas "Termius", id: 1176074088
vscode "2gua.rainbow-brackets"
vscode "aaron-bond.better-comments"
vscode "AdamCaviness.theme-monokai-dark-soda"
vscode "akamud.vscode-theme-onedark"
vscode "andys8.jest-snippets"
vscode "Angular.ng-template"
vscode "bcanzanella.openmatchingfiles"
vscode "bradlc.vscode-tailwindcss"
vscode "brittanychiang.halcyon-vscode"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.path-intellisense"
vscode "CircleCI.circleci"
vscode "dahong.theme-bear"
vscode "DanielSanMedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.FreeMarker"
vscode "DigitalBrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "GitHub.github-vscode-theme"
vscode "GregorBiswanger.json2ts"
vscode "HallerPatrick.solarized-autumn"
vscode "hangxingliu.vscode-systemd-support"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-power-mode"
vscode "IronGeek.vscode-env"
vscode "iulian-radu-at.find-unused-exports"
vscode "JayFong.generate-index"
vscode "kakumei.ts-debug"
vscode "kuscamara.electron"
vscode "loiane.ts-extension-pack"
vscode "loilo.snazzy-light"
vscode "luqimin.tiny-light"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.python"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "raeesa.monokai-light"
vscode "repeale.material-monokai"
vscode "ritwickdey.LiveServer"
vscode "sburg.vscode-javascript-booster"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tootone.org-mode"
vscode "vscode-icons-team.vscode-icons"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "Zignd.html-css-class-completion"
